Revit 2027 API
ExternalResourceServerUtils Class
 Contains utilities related to external resource server.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceServerUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ExternalResourceServerUtils
Public NotInheritable Class ExternalResourceServerUtils
public ref class ExternalResourceServerUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalResourceServerUtils = class end
The ExternalResourceServerUtils type exposes the following members.
Methods
Name | Description
IsValidShortName |  Checks whether the name is a valid short name for the external resource server.
ServerSupportsAssemblyCodeData |  Checks that the server referenced by the given ExternalResourceReference supports AssemblyCodeData.
ServerSupportsCADLinks |  Checks that the server referenced by the given ExternalResourceReference supports CAD links.
ServerSupportsIFCLinks |  Checks that the server referenced by the given ExternalResourceReference supports IFC links.
ServerSupportsKeynotes |  Checks that the server referenced by the given ExternalResourceReference supports KeynoteTable data.
ServerSupportsRevitLinks |  Checks that the server referenced by the given ExternalResourceReference supports Revit links.
Top
See Also
Reference
Autodesk.Revit.DB Namespace